from Player import Player
from Subjects import Subjects
'''
HP - здоровье ( если становится ниже 0 персонаж умирает )
XP - опыт ( получается от убийства врагов )
LVL - уровень героя ( чем выше уровень, тем выше HP, XP, Damage )
Damage - урон героя ( в бою умножается от 0.75 до 1.25 в зависимости от рандома )
Chance - шанс атаки ( является произведением шанса от оружия, от брони и аксессуаров)
Luck - удача ( от неё зависит качество выпадаемых предметов )
*****
Некоторые артефакты дают особенные параметры, такие как дополнительный процент к восстановлению здоровья препаратами или
    дополнительные слоты для артефактов
Некоторые артефакты при снятии ломаются
*****
Аксы реализовывать пока небуду ибо впадлу
'''


